[
  {
    "titulo": "12. Números combinatorios. Triángulo de Pascal",
    [cite_start]"contenido": "<strong>Definición</strong>\n\nLos números de la forma $\\frac{n!}{r!(n-r)!}$ son importantes en Matemáticas, reciben el nombre de números combinatorios y se representan con la notación:\n\n$$\\binom{n}{r} = \\frac{n!}{r!(n-r)!}$$\n\nEn donde $n$ es el numerador y $r$ el denominador u orden del número combinatorio [cite: 575-580].\n\n<strong>Propiedades de los números combinatorios</strong>\n\nLos números combinatorios tienen las propiedades siguientes:\n\n<strong>I.</strong> Los números combinatorios de orden cero valen la unidad. En efecto, de acuerdo a la definición de número combinatorio se tiene:\n$$\\binom{n}{0} = \\frac{n!}{0!(n-0)!} = \\frac{n!}{n!} = 1$$\n\n<strong>II.</strong> Los números combinatorios de orden igual a su numerador valen la unidad. En efecto:\n$$\\binom{n}{n} = \\frac{n!}{n!(n-n)!} = \\frac{n!}{n!} = 1$$\n\n<strong>III.</strong> Los números combinatorios de órdenes complementarios son iguales entre sí, es decir:\n$$\\binom{n}{r} = \\binom{n}{n-r}$$\n\n<strong>IV.</strong> La suma de los números combinatorios de igual numerador y órdenes diferentes en una unidad, es igual a un número combinatorio de numerador igual a una unidad más grande que la de los sumandos y orden igual al mayor de los órdenes de los combinatorios sumandos, es decir:\n$$\\binom{n}{r-1} + \\binom{n}{r} = \\binom{n+1}{r}$$\n\n<strong>Triángulo de Pascal</strong>\n\nLos números combinatorios de todos los numeradores a partir de uno y de todos los posibles órdenes pueden escribirse formando un triángulo aritmético. [cite_start]De acuerdo a las propiedades establecidas, se observa que:\n\n• Los números combinatorios que están a los extremos de cada línea valen la unidad.\n• Los números combinatorios colocados en posiciones simétricas con respecto a la vertical son iguales.\n• La suma de dos números combinatorios adyacentes sobre una misma línea horizontal, es igual al número combinatorio que está inmediatamente abajo de los dos considerados (Propiedad IV).\n\nEste arreglo triangular se llama <strong>Triángulo de Pascal</strong> [cite: 610-613].\n\n[simulador:Simulador_Triangulo_Pascal]"
  },
  {
    "titulo": "13. Diagramas de árbol",
    "contenido": "<strong>Definición y Uso</strong>\n\nUn diagrama de árbol es una herramienta gráfica que se usa para enumerar todas las posibilidades lógicas de una secuencia de actos o eventos que ocurran de un número finito de maneras.\n\nEn la gráfica se representan por medio de rectas las diferentes acciones que se pueden elegir, llamadas las <strong>ramas del árbol</strong>. Las ramas parten de puntos que representan instantes del tiempo o lugares en el espacio, llamados los <strong>nodos del árbol</strong>, en donde se elige alguna de las posibles formas lógicas de actuar. [cite_start]Las ramas llegan a nuevos nodos en donde se vuelve a decidir sobre nuevas acciones a tomar [cite: 630-632].\n\n<strong>Ejemplo 29: Viajes Redondos</strong>\n\nPara resolver problemas de rutas (como ir de A a C pasando por B y regresar), el diagrama de árbol permite visualizar cada tramo. [cite_start]Por ejemplo, si hay 2 caminos de A a B ($l_1, l_2$) y luego otros caminos hacia C, el árbol muestra todas las combinaciones posibles rama por rama. [cite: 765]\n\n<strong>Ejemplo 30: Torneo de Tenis</strong>\n\nSergio y Antonio participan en un torneo de tenis. El primero que gane dos juegos seguidos o un total de tres será el vencedor del torneo. ¿De cuántas maneras puede terminar el torneo?\n\nAl trazar el diagrama (Rama S si gana Sergio, Rama A si gana Antonio), se observa que hay ramas que terminan antes (ej. S-S) y otras que se extienden (S-A-S...). [cite_start]Contando las puntas finales de las ramas, se determina el total de formas posibles [cite: 788-789].\n\n[simulador:Simulador_Diagrama_Arbol]"
  }
]
